jliphard/wearable_nRF52_Firmware/main.c
/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */

static void timeout_handler(void * p_context);

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */

// General application timer settings.
//#define APP_TIMER_PRESCALER             15    // Value of the RTC1 PRESCALER register.
//#define APP_TIMER_OP_QUEUE_SIZE         4     // Size of timer operation queues.
    
static void RTC1_timer_init(void)
{
    // Initialize timer module.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create timers.
    err_code = app_timer_create(&m_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                timeout_handler);
    APP_ERROR_CHECK(err_code);

}

/**@brief Function for starting application timers.
 */
static void RTC1_timer_start(void)
{
    //Start application timers.
    err_code = app_timer_start(m_timer_id, MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting application timers.
 */
static void RTC1_timer_stop(void)
{
    //Stop application timers.
    err_code = app_timer_stop(m_timer_id);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_HEART_RATE_SENSOR_HEART_RATE_BELT);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief GATT module event handler.
 */
static void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    if (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED)
    {
        //NRF_LOG_INFO("GATT ATT MTU on connection 0x%x changed to %d.\r\n",
        //             p_evt->conn_handle,
        //             p_evt->params.att_mtu_effective);
    }

    ble_ma_on_gatt_evt(&m_ma, p_evt);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);
}


// Mentaid Measurement flag bits
#define MA_FLAG_SAVE_TO_FLASH       (0x01 << 0)                           
#define MA_FLAG_SAMPLE_SENSORS      (0x01 << 1)
#define MA_FLAG_LIVESTREAM          (0x01 << 2)                           

/**@brief Function for initializing services that will be used by the application.
 *
 * @details Initialize the Mentaid, Battery and Device Information services.
 */
static void ble_services_init(void)
{
    ble_ma_init_t   ma_init;  //this one includes data, status, and command
    ble_bas_init_t  bas_init; //battery
    ble_dis_init_t  dis_init; //device information
    
    //uint8_t body_sensor_location;

    // Initialize Heart Rate Service.
    //body_sensor_location = 1;//BLE_MA_BODY_SENSOR_LOCATION_WRIST;

    memset(&ma_init, 0, sizeof(ma_init));

    ma_init.evt_handler = NULL;
    
    // Here the sec level for the Mentaid Service can be changed/increased.
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(     &ma_init.ma_attr_md.cccd_write_perm);
    
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&ma_init.ma_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&ma_init.ma_attr_md.write_perm);
    
    // Command
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(     &ma_init.command_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(     &ma_init.command_attr_md.write_perm);
    
    uint8_t cs = 0;
    
    if( SaveToFLASH )   cs |= MA_FLAG_SAVE_TO_FLASH;
    if( SampleSensors ) cs |= MA_FLAG_SAMPLE_SENSORS;
    if( LiveStream )    cs |= MA_FLAG_LIVESTREAM;
    
    ma_init.current_status = cs;
        
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(     &ma_init.status_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&ma_init.status_attr_md.write_perm); //Phone does not need to write

    //this is the key function which will fire up everything else
    err_code = ble_ma_init(&m_ma, &ma_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Battery Service.
    memset(&bas_init, 0, sizeof(bas_init));

    // Here the sec level for the Battery Service can be changed/increased.
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&bas_init.battery_level_char_attr_md.write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_report_read_perm);

    bas_init.evt_handler          = NULL;
    bas_init.support_notification = true;
    bas_init.p_report_ref         = NULL;
    bas_init.initial_batt_level   = 100;

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);

