jliphard/wearable_nRF52_Firmware/main.c
        case BLE_GATTS_EVT_WRITE:
            
            //apparently, there is only one GATTS channel - how do we know which one?
            //this is for all data coming back from phone.....
            SEGGER_RTT_WriteString(0, "BLE_GATTS_EVT_WRITE\n");
            
            //uint8_t new_hex_status = 0;
            
            uint8_t * p_data = p_ble_evt->evt.gatts_evt.params.write.data;
            //uint16_t length  = p_ble_evt->evt.gatts_evt.params.write.len;
            uint8_t new_command = p_data[0];
            
            SEGGER_RTT_printf(0, "New command: %d\r\n", new_command);
            
            if(       new_command == 32 )
            {
                SaveToFLASH = false;
                update_status_flags();
                SEGGER_RTT_WriteString(0, "Turning OFF save to FLASH\n");
            } 
            else if ( new_command == 33 )
            {
                SaveToFLASH = true;
                update_status_flags();
                SEGGER_RTT_WriteString(0, "Turning ON save to FLASH\n");
            }
            else if ( new_command == 12 )
            {
                SampleSensors = false;
                update_status_flags();
                SEGGER_RTT_WriteString(0, "Turning OFF sampling\n");
            }
            else if ( new_command == 13 )
            {
                SampleSensors = true;
                update_status_flags();
                SEGGER_RTT_WriteString(0, "Turning ON sampling\n");
            }
            else if ( new_command == 34 )
            {
                LiveStream = false;
                update_status_flags();
                SEGGER_RTT_WriteString(0, "Turning OFF livestream\n");
            }
            else if ( new_command == 35 )
            {
                LiveStream = true;
                update_status_flags();
                SEGGER_RTT_WriteString(0, "Turning ON livestream\n");
            }
            else if ( new_command == 42 )
            {
                SEGGER_RTT_WriteString(0, "Flushing to phone\n");
                PleaseFlush = true;  
            }
            //ok, so what is the value of the characteristic now?
            /*
             err_code = ble_hrs_heart_rate_measurement_send_MAP(&m_hrs, heartbeat16, battery_level8, 
                                                                BMP280P8, BMP280T8, BMP280H8, 
                                                                resultVME[3], 
                                                                resultBMA[0], resultBMA[1], resultBMA[2]);
             */
            //print it out.....
            break; // BLE_GATTS_EVT_TIMEOUT
            
        case BLE_EVT_USER_MEM_REQUEST:
            SEGGER_RTT_WriteString(0, "BLE_EVT_USER_MEM_REQUEST\n");
            err_code = sd_ble_user_mem_reply(m_conn_handle, NULL);
            APP_ERROR_CHECK(err_code);
            break; // BLE_EVT_USER_MEM_REQUEST

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
        {
            SEGGER_RTT_WriteString(0, "BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST\n");
            
            ble_gatts_evt_rw_authorize_request_t req;
            ble_gatts_rw_authorize_reply_params_t auth_reply;

            req = p_ble_evt->evt.gatts_evt.params.authorize_request;

            if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
            {
                if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
                {
                    if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                        SEGGER_RTT_WriteString(0, "BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST - Write\n");
                    }
                    else
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                        SEGGER_RTT_WriteString(0, "BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST - Read\n");
                    }
                    auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
                    err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                               &auth_reply);
                    APP_ERROR_CHECK(err_code);
                }
            }
        } break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST


        default:
            //SEGGER_RTT_WriteString(0, "Default - some other number that is not handled\n");
            // No implementation needed.
            break;
    }
}

/**@brief Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 * @details This function is called from the BLE Stack event interrupt handler after a BLE stack
 *          event has been received.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    //SEGGER_RTT_WriteString(0, "ble_evt_dispatch\n");
    ble_conn_state_on_ble_evt(p_ble_evt);
    pm_on_ble_evt(p_ble_evt);
    ble_ma_on_ble_evt(&m_ma, p_ble_evt);
    ble_bas_on_ble_evt(&m_bas, p_ble_evt);
    ble_conn_params_on_ble_evt(p_ble_evt);
    bsp_btn_ble_on_ble_evt(p_ble_evt);
    on_ble_evt(p_ble_evt);
    ble_advertising_on_ble_evt(p_ble_evt);
    nrf_ble_gatt_on_ble_evt(&m_gatt, p_ble_evt);
}

/**@brief Function for dispatching a system event to interested modules.
 *
 * @details This function is called from the System event interrupt handler after a system
 *          event has been received.
 *
 * @param[in] sys_evt  System stack event.
 */
static void sys_evt_dispatch(uint32_t sys_evt)
{
    // Dispatch the system event to the fstorage module, where it will be
    // dispatched to the Flash Data Storage (FDS) module.
    fs_sys_event_handler(sys_evt);

