jliphard/wearable_nRF52_Firmware/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}

/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

//=====================================
void FLASH_Write_Record( uint8_t wp[] )
{
  //we write in blocks of 16 lines.
  if( record_counter < 16 )
  {
    //keep adding to buffer...
    flash_page_buffer[record_counter * 16 +  0] = wp[ 0];
    flash_page_buffer[record_counter * 16 +  1] = wp[ 1];  
    flash_page_buffer[record_counter * 16 +  2] = wp[ 2];  
    flash_page_buffer[record_counter * 16 +  3] = wp[ 3];  
    flash_page_buffer[record_counter * 16 +  4] = wp[ 4];  
    flash_page_buffer[record_counter * 16 +  5] = wp[ 5];  
    flash_page_buffer[record_counter * 16 +  6] = wp[ 6];  
    flash_page_buffer[record_counter * 16 +  7] = wp[ 7];  
    flash_page_buffer[record_counter * 16 +  8] = wp[ 8];  
    flash_page_buffer[record_counter * 16 +  9] = wp[ 9]; 
    flash_page_buffer[record_counter * 16 + 10] = wp[10];  
    flash_page_buffer[record_counter * 16 + 11] = wp[11];  
    flash_page_buffer[record_counter * 16 + 12] = wp[12];  
    flash_page_buffer[record_counter * 16 + 13] = wp[13];  
    flash_page_buffer[record_counter * 16 + 14] = wp[14];
    flash_page_buffer[record_counter * 16 + 15] = wp[15];
            
    record_counter++;   
  }
  
  if (record_counter >= 16 )
  {
        flash_green();
        
        SEGGER_RTT_printf(0, "TH:%d VB:%d DP:%d\r\n", heartbeat16, battery_level8, GLOB_datastart);
        //SEGGER_RTT_printf(0, "Datapage:%d\r\n", GLOB_datastart);
        
        //flush to memory.... 
        FLASH_Page_Write( GLOB_datastart, flash_page_buffer );  
     
        //advance counter  
        GLOB_datastart++;
    
        //clear the buffer  
        memset(flash_page_buffer, 0, sizeof(flash_page_buffer));
        
        //and reset the counter
        record_counter = 0; 
    }
  
};

static void Send_Via_BLE( uint8_t * data )
{
    //pack in the GLOB_datastart
    //and then send
    
    data[14] = (uint8_t) ( GLOB_datastart       & 0xff);
    data[15] = (uint8_t) ( GLOB_datastart >> 8  & 0xff); 

    ret_code_t err_code = NRF_SUCCESS;
        
    err_code = ma_measurement_send_16( &m_ma, data );

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        APP_ERROR_HANDLER(err_code);
    }
}

void save_or_stream( uint8_t action, uint16_t counter, uint8_t batt, \
        uint8_t pressure, uint8_t temperature, uint8_t humidity,     \
        uint16_t l_white,                                            \
        int16_t ax, int16_t ay, int16_t az )
{ 

    memset(fb, 0, sizeof(fb));
    
    //timestamp
    fb[ 0] = (uint8_t) ( counter      & 0xff );
    fb[ 1] = (uint8_t) ( counter >> 8 & 0xff );
    
    fb[ 2] = batt;
    
    fb[ 3] = pressure;
    fb[ 4] = temperature;
    fb[ 5] = humidity;
    
    fb[ 6] = (uint8_t) ( l_white      & 0xff ); 
    fb[ 7] = (uint8_t) ( l_white >> 8 & 0xff ); 
    
    fb[ 8] = (uint8_t) ( ax            & 0xff); 
    fb[ 9] = (uint8_t) ( ax      >> 8  & 0xff); 
    
    fb[10] = (uint8_t) ( ay            & 0xff); 
    fb[11] = (uint8_t) ( ay      >> 8  & 0xff); 
    
    fb[12] = (uint8_t) ( az            & 0xff);
    fb[13] = (uint8_t) ( az      >> 8  & 0xff); 
    
    fb[14] = 0;
    fb[15] = 0; 

    if( action == 0 ) //save only
    {
        FLASH_Write_Record( fb );  
    }
    else if (action == 1 ) //send only
    {
        Send_Via_BLE( fb ); 
    }
    else if (action == 2) //do both
    {
        FLASH_Write_Record( fb ); 
        Send_Via_BLE( fb ); 
    }
}

static void update_battery(void)
{            
    //Battery ADC read
    //this will update Current_VBATT() via callback
    nrf_drv_saadc_sample(); 
    
    //convert to percent from voltage - 3.8V is full
    battery_level_Percent  = (uint8_t)(100.00 * (float)Current_VBATT()/420.00);
    
    //for debugging let's record the actual voltage
    battery_level8 = (uint8_t)(Current_VBATT() - 300);
    //SEGGER_RTT_printf(0, "Battery: %d\n", battery_level8);
    
    //bluetooth update
    ret_code_t err_code = NRF_SUCCESS;  
    err_code = ble_bas_battery_level_update(&m_bas, battery_level_Percent);

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)) {
        APP_ERROR_HANDLER(err_code);
    } 
    
}

static void update_fast(void)
{

    if( !SampleSensors ) return; //stop doing anything, basically. Useful for flushing data.
    //since when we are not sampling, it is pointless to save or stream, we do neither. 
    //we also stop the slow battery loop.
    
    SEGGER_RTT_WriteString(0, "Tick\n");
    
    //Green flashes means we are sampling
    flash_green();
    
    if ( batt_cycle > 3 ) 
    {
        update_battery();
        batt_cycle = 0;
    } else {
        batt_cycle++;
    };
    
    heartbeat16++; //this is the number of sampling cycles. 
        
    //Pressure, Temp, and Humidity
    BME280_Get_Data(resultPTH);
    
    BMP280P8 = (uint8_t)( (resultPTH[0]/  10.00) - 10000.0 ); //need to add 10000 to the pressure and then divide by 10. 
    BMP280T8 = (uint8_t)( (resultPTH[1]/  10.00) - 200.0   ); //need to add 200 to the temp and then divide by 10
    BMP280H8 = (uint8_t)( (resultPTH[2]/1000.00)           );
    
    //light intensity
    VEML6040_Get_Data(resultVME);
    //the different colors are largely useless - just get white
    
    //acceleration
    BMA280_Get_Data(resultBMA);
    
