jliphard/wearable_nRF52_Firmware/main.c
    /*
    float ax = (float)resultBMA[0];
    float ay = (float)resultBMA[1];
    float az = (float)resultBMA[2];//take off gravity
    
    float accelT = (ax*ax) + (ay*ay) + (az*az);
    
    accelT = sqrt(accelT);
    */
    
    //SEGGER_RTT_printf(0, "x-axis offset = %d mg\n", (int16_t)(100.0f*(float)offsetX*FCres/256.0f));
    //SEGGER_RTT_printf(0, "accel:%d\n", (uint16_t)accelT);
        
    uint8_t action = 0;
    
    if( SaveToFLASH && LiveStream )
    {
        action = 2;
        save_or_stream( action, heartbeat16, battery_level8,
                      BMP280P8, BMP280T8, BMP280H8,
                      resultVME[3],
                      resultBMA[0], resultBMA[1], resultBMA[2] );    
    }
    else if ( SaveToFLASH && !LiveStream ) //save only
    {
        action = 0;
        save_or_stream( action, heartbeat16, battery_level8,
                      BMP280P8, BMP280T8, BMP280H8,
                      resultVME[3],
                      resultBMA[0], resultBMA[1], resultBMA[2] );    
    }
    else if ( !SaveToFLASH && LiveStream ) //stream only
    {
        action = 1;
        save_or_stream( action, heartbeat16, battery_level8,
                      BMP280P8, BMP280T8, BMP280H8,
                      resultVME[3],
                      resultBMA[0], resultBMA[1], resultBMA[2] );    
    }
    

    
}

static void timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    //SEGGER_RTT_WriteString(0, "TH.\n"); 
    update_fast();
}

int main(void)
{
    SEGGER_RTT_WriteString(0, "\n\n***********\n");
    
    RTC1_timer_init();
     
    leds_init();
    
    bool erase_bonds = true;
    //buttons_leds_init(&erase_bonds);
    
    if( 1 == 2 ) {
        lfclk_request(); // Request LF clock - needed when softdevice is off
    } else {
        ble_stack_init(); //fire up the softdevice
    }
        
    gap_params_init();
    gatt_init();
    advertising_init();
    ble_services_init();   
    conn_params_init();
    peer_manager_init();
    
    //ADC subsystem 
    ADC_init();
        
    //I2C bus. 
    I2C_init();
    
    //BME280 init. 
    BME280_Turn_On();

    nrf_delay_ms(500);
    
    VEML6040_Turn_On();
    
    nrf_delay_ms(500);
    
    BMA280_Turn_On_Fast();
    
    nrf_delay_ms(500);
    
    BMA280_Calibrate();
       
    nrf_delay_ms(500);
    
    //save energy - do not need to sample that quickly
    BMA280_Turn_On_Slow();
    
    //Flash memory
    FLASH_Init();
    
    FLASH_Print_ID();
    
    nrf_delay_ms(500);
    
    //FLASH_Reset();    
    //FLASH_Erase();
    
    GLOB_datastart = FLASH_Get_First_Available_Location();
    SEGGER_RTT_printf(0, "First empty page: %d\r\n", GLOB_datastart);
    
    flash_red();
    
    //static uint8_t lR[16];
     
    /* The four basic functions are to:
     * (1) erase
     * (2) record
     * (3) record + stream data to phone. 
     * (4) get data from phone - especially position and time
     * 
     * We could advertize for two mins after turn on. 
     * If no connection -> record
     * If connection, then would synchronize time, and get occasional GPS packets.
     * Also, would send data to phone app. 
     * In the same app, could chose to delete data
     * Could also flush data to pubnub?
    */ 
    
    RTC1_timer_start();
    
    //controls visibility to bluetooth - not clear to me if advertizing interval is honored
    advertising_start(erase_bonds);
     
    while( 1 ) 
    {
        if ( PleaseFlush ) {
            
                bool OldStateSampleSensors = SampleSensors;
                bool OldStateSaveToFLASH   = SaveToFLASH;
                bool OldStateLiveStream    = LiveStream;
                
                SampleSensors = false;
                SaveToFLASH   = false;
                LiveStream    = false;
                
                //RTC1_timer_stop();
                
                uint16_t lastLineWithData = GLOB_datastart * 16; /*16 lines per page; GLOB_datastart is in page units*/
                
                static uint8_t lR[16];
                
                for( uint16_t i = 0; i < lastLineWithData; i++) 
                {  
                    nrf_delay_ms(100);
                    
                    FLASH_Line_Read(i, lR);
                    
                    //pack in the page data
                    lR[14] = (uint8_t) ( i       & 0xff);
                    lR[15] = (uint8_t) ( i >> 8  & 0xff); 
                    
                    //cannot send faster than the connection internal, which is 50 ms
                    ma_measurement_send_16( &m_ma, lR );
                    
                    /*
                    SEGGER_RTT_WriteString(0, "Sent...\n");

                    for(uint16_t j = 0; j < 16; j++) 
                    { 
                        SEGGER_RTT_printf(0, "%d ", lR[j]);
                    };
        
                    SEGGER_RTT_WriteString(0, "\n");
                    */
                };
    
                //and go back to previous state....
                SampleSensors = OldStateSampleSensors;
                SaveToFLASH   = OldStateSaveToFLASH;
                LiveStream    = OldStateLiveStream;
                
                PleaseFlush = false;
        }
        
        __WFE();
    };
     
    /*
    for (;;)
        {
            if (NRF_LOG_PROCESS() == false)
            {
                power_manage();
            }
        }
    */
}
